Tekla.Structures.ModelInternal.dotTaskWorktype_t
Struct for the TaskWorktype.

Tekla.Structures.ModelInternal.dotTaskWorktype_t.ModelObject
The object we are extending (Inherited from).

Tekla.Structures.ModelInternal.dotTaskWorktype_t.aName
Name of the task worktype.